app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
  <ul class='post-comment'>
    <% if @post.comments.length == 0 %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
---
    <% else %>
      <% @post.comments.each do |comment| %>