app/controllers/likes_controller.rb

  def create
    @like = current_user.likes.new
    @like.post_id = params[:post_id]

    if @like.save
---
INSERT INTO "likes" ("post_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 7], ["author_id", 1], ["created_at", "2022-12-02 14:54:34.957106"], ["updated_at", "2022-12-02 14:54:34.957106"]]