app/controllers/posts_controller.rb

  def index
    @user = User.find(params[:user_id])
    @posts = @user.posts.includes(:comments)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @post = Post.includes(:comments, :likes).find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 4]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "text", "comments_counter", "likes_counter", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"