app/models/like.rb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 7]]
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2022-12-02 14:54:35.904833"], ["id", 7]]
---
  def update_like_counter
    post.update(like_counter: post.likes.all.length)